@"https://atcoder.jp/contests/abc049/tasks/abc049_b
縦 H ピクセル、横 W ピクセルの画像があります。
全てのピクセルは . または * で表されるものとします。
上から i 番目、左から j 番目のピクセルを表す文字を C{i,j} で表します。

この画像を 2 倍縦長にした画像を出力してください。
すなわち、縦 2H ピクセル、横 W ピクセルの画像であって、
上から i 番目、左から j 番目のピクセルは、C{(i+1)/2,j}
​(ただし、割り算は切り捨て)と等しい画像を出力してください。

制約
1≦H,W≦100
C{i,j} . または * である。"
#r "nuget: FsUnit"
open FsUnit

let solve H W (Cs: array<string>) =
    let cs = Cs |> Array.map (fun x -> seq x |> Seq.map string |> Seq.toArray)
    [|1..2*H|]
    |> Array.map (fun i -> [|1..W|] |> Array.map (fun j -> cs.[((i-1)/2)].[j-1]) |> System.String.Concat)
let H, W = stdin.ReadLine().Split() |> Array.map int |> (fun x -> x.[0], x.[1])
let Cs = [| for i in 1..H do stdin.ReadLine() |]
solve H W Cs |> String.concat "\n" |> stdout.WriteLine

solve 2 2 [|"*.";".*"|] |> should equal [|"*.";"*.";".*";".*"|]
solve 1 4 [|"***."|] |> should equal [|"***.";"***."|]
solve 9 20 [|".....***....***.....";"....*...*..*...*....";"...*.....**.....*...";"...*.....*......*...";"....*.....*....*....";".....**..*...**.....";".......*..*.*.......";"........**.*........";".........**........."|]
|> should equal [|".....***....***.....";".....***....***.....";"....*...*..*...*....";"....*...*..*...*....";"...*.....**.....*...";"...*.....**.....*...";"...*.....*......*...";"...*.....*......*...";"....*.....*....*....";"....*.....*....*....";".....**..*...**.....";".....**..*...**.....";".......*..*.*.......";".......*..*.*.......";"........**.*........";"........**.*........";".........**.........";".........**........."|]
